/**
 ******************************************************************************
 * @file      start.c
 * @brief     C Source file of start.c.
 * @details   This file including all API functions's implement of start.c.	
 * @copyright  Copyright(C), JunGeGe
 ******************************************************************************
 */
 
/*-----------------------------------------------------------------------------
 Section: Includes
 ----------------------------------------------------------------------------*/
#include <types.h>

/*-----------------------------------------------------------------------------
 Section: Type Definitions
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Constant Definitions
 ----------------------------------------------------------------------------*/
/* NONE */ 

/*-----------------------------------------------------------------------------
 Section: Global Variables
 ----------------------------------------------------------------------------*/
extern uint32_t _etext; //The end of text;
extern uint32_t _bss;   //The start of bss;
extern uint32_t _ebss;
extern uint32_t _data;
extern uint32_t _edata;


/*-----------------------------------------------------------------------------
 Section: Local Function Prototypes
 ----------------------------------------------------------------------------*/
void reset_routine(void);
static void default_routine(void);
static void dummy(void);


/*-----------------------------------------------------------------------------
 Section: Local Variables
 ----------------------------------------------------------------------------*/
static uint32_t the_cstack[1024 * 10];

__attribute__((section(".isr_vector")))
const VOIDFUNCPTR vector_table[] =
{
    (VOIDFUNCPTR)((uint32_t)the_cstack + sizeof(the_cstack)),/* 栈顶指针 */
    reset_routine,      /* 复位中断  */
    default_routine,    /* NMI中断 */
    default_routine,    /* 硬件错误 */
    default_routine,    /* 存储器管理错误 */
    default_routine,    /* 总线错误 */
    default_routine,    /* 用法错误 */
    dummy, /* 空闲 */
    dummy, /* 空闲 */
    dummy, /* 空闲 */
    dummy, /* 空闲 */
    dummy, /* 空闲 */
    dummy, /* 空闲 */
    dummy, /* 空闲 */
    dummy, /* 空闲 */
    dummy,// systick_routine, /* 15系统定时器 */
};



/*-----------------------------------------------------------------------------
 Section: Global Function Prototypes
 ----------------------------------------------------------------------------*/
void
main(void);

extern void
bspHwInit(void);

/*-----------------------------------------------------------------------------
 Section: Function Definitions
 ----------------------------------------------------------------------------*/
/**
 ******************************************************************************
 * @brief   复位中断入口
 * @return  None
 ******************************************************************************
 */
void
reset_routine(void)
{
    bspHwInit();//上电需要立刻初始化的硬件

    uint32_t *pul_src;
    uint32_t *pul_dest;

    /* 从闪存复制初始化数据段到SRAM中. */
    for (pul_dest = &_data, pul_src = &_etext; pul_dest < &_edata;)
    {
        *pul_dest++ = *pul_src++;
    }

    /* bss段清零 */
    for (pul_dest = &_bss; pul_dest < &_ebss;)
    {
        *pul_dest++ = 0;
    }

    /* 跳转到主程序 */
    main();
}

/**
 ******************************************************************************
 * @brief   异常中断入口
 * @return  None
 ******************************************************************************
 */
static void
default_routine(void)
{
    while (TRUE)
    {
    }
}

/**
 ******************************************************************************
 * @brief   空闲中断入口
 * @return  None
 ******************************************************************************
 */
static void
dummy(void)
{
    return;
}


/**
 ******************************************************************************
 * @brief   boot主程序
 * @return  None
 ******************************************************************************
 */

/*----------------------------start.c--------------------------------*/
