/**
 ******************************************************************************
 * @file      main.c
 * @brief     C Source file of main.c.
 * @details   This file including all API functions's implement of main.c.	
 * @copyright  Copyright(C)
 ******************************************************************************
 */
 
/*-----------------------------------------------------------------------------
 Section: Includes
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Type Definitions
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Constant Definitions
 ----------------------------------------------------------------------------*/
/* NONE */ 

/*-----------------------------------------------------------------------------
 Section: Global Variables
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Local Variables
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Local Function Prototypes
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Global Function Prototypes
 ----------------------------------------------------------------------------*/
/* NONE */

/*-----------------------------------------------------------------------------
 Section: Function Definitions
 ----------------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <test.h>
#include <task.h>
#include <shell.h>
#include <windows.h>



int main(void)
{
    puts("_______________start_________________________");
   // __DO_WHITEBOX_TEST();
    puts("_______________end_________________________");
    extern status_t
    shell_init(void);


    shell_init();

    while(1);
    {
        Sleep(1000);
    }
    return EXIT_SUCCESS;
}


/**
 ******************************************************************************
 * @brief   重启命令
 * @param[in]  *cmdtp   : shell命令信息
 * @param[in]  argc     : 命令行参数数量
 * @param[in]  *argv[]  : 命令行参数内容
 *
 * @retval  命令执行状态
 ******************************************************************************
 */
static uint32_t
do_reboot(cmd_tbl_t * cmdtp,
        uint32_t argc,
        const uint8_t *argv[])
{
    //bsp_reboot();
    printf("reboot\n");
    return 1;
}

SHELL_CMD(
    reboot, CFG_MAXARGS, (SHELL_CMD_FUNCPTR)do_reboot,
    "reboot \n"
);


#ifdef __WHITEBOX_TEST

__INIT_SUITE(main)   {return 0;}
__CLEAN_SUITE(main)  {return 0;}

__IMPLEMENT_TEST(test)
{
    CU_PASS("just for test...");
}

__BEGIN_TESTMAP_OF_SUITE(main)
    __REG_TEST(test)
__END_TESTMAP()

#endif


/*----------------------------main.c--------------------------------*/
